/*Empires & Allies е стратегиска игра во повеќе нивоа со можност за играње од
страна на повеќе играчи. Секој играч има своја територија, како и одбранбени
и напаѓачки единици. Може да влезе во битка (напад на туѓа територија или
одбрана на сопствената) со други играчи што може да заврши со победа или
пораз за што се добиваат поени. Да се напише програма во која од тастарура се
внесува бројот на играчи на играта Empires & Allies. За секој играч потоа се
внесуваат податоци за ниво (цел број), број на победи и број на порази.
Резултатот на играчот се пресметува на следниот начин:
• ако се работи за прво ниво, секоја победа носи 13 поени, а секој пораз носи -1
поен
• ако се работи за второ ниво, секоја победа носи 13 поени, а секој пораз носи
-3 поени
За секој играч треба да се испечати Dobar igrac ако неговиот број на поени е
позитивен или Los igrac во сите други случаи. Потоа треба да се најде и
испечати најдобриот резултат (најголемиот вкупен број на поени), како и
редниот број на играчот со најдобар резултат (првиот играч е со реден број
еден, вториот со реден број два итн.). Ако постојат повеќе играчи со ист
најдобар резултат, да се испечати редниот број на првиот таков играч. */
#include <stdio.h>

int main()
{
    int num_of_players; scanf("%d", &num_of_players);
    int max_points=0, best_player_inex;

    for(int i=0; i<num_of_players; i++)
    {
        int points=0, level, wins, losses;
        scanf("%d %d %d", &level, &wins, &losses);

        switch(level){ case 1: points += losses*-1; break;
        case 2: points += losses*-3; break; } points+= wins * 13;

        if(points < 0){ printf("Los igrac\n"); } else printf("Dobar igrac\n");
        if(points>max_points){ max_points=points; best_player_inex=i; }
    }

    printf("Najdobar igrac: br.%d, %d poeni", best_player_inex+1, max_points);

    return 0;
}
